dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/ADC1_4MSPS_1.0.xml
        <register id="ADC1_CPU_INT_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="INIFG" description="Mask INIFG in MIS_EX register." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="LOWIFG" description="Raw interrupt flag for the MEMRESx result register being below
than the WCLOWx threshold of the window comparator.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="HIGHIFG" description="Raw interrupt flag for the MEMRESx result register being higher
than the WCHIGHx threshold of the window comparator.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="OVIFG" description="Raw interrupt flag for MEMRESx overflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="UVIFG" description="Raw interrupt flag for MEMRESx underflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR is set to 1." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="TOVIFG" description="Raw interrupt flag for sequence conversion trigger overflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="DMADONE" description="Raw interrupt flag for DMADONE. 
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="MEMRESIFG0" description="Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG1" description="Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG2" description="Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG3" description="Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG4" description="Raw interrupt status for MEMRES4.
This bit is set to 1 when MEMRES4 is loaded with a new
conversion result.
Reading MEMRES4 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG5" description="Raw interrupt status for MEMRES5.
This bit is set to 1 when MEMRES5 is loaded with a new
conversion result.
Reading MEMRES5 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG6" description="Raw interrupt status for MEMRES6.
This bit is set to 1 when MEMRES6 is loaded with a new
conversion result.
Reading MEMRES6 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG7" description="Raw interrupt status for MEMRES7.
This bit is set to 1 when MEMRES7 is loaded with a new
conversion result.
Reading MEMRES7 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG9" description="Raw interrupt status for MEMRES9.
This bit is set to 1 when MEMRES9 is loaded with a new
conversion result.
Reading MEMRES9 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG10" description="Raw interrupt status for MEMRES10.
This bit is set to 1 when MEMRES10 is loaded with a new
conversion result.
Reading MEMRES10 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG11" description="Raw interrupt status for MEMRES11.
This bit is set to 1 when MEMRES11 is loaded with a new
conversion result.
Reading MEMRES11 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG12" description="Raw interrupt status for MEMRES12.
This bit is set to 1 when MEMRES12 is loaded with a new
conversion result.
Reading MEMRES12 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG13" description="Raw interrupt status for MEMRES13.
This bit is set to 1 when MEMRES13 is loaded with a new
conversion result.
Reading MEMRES13 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG14" description="Raw interrupt status for MEMRES14.
This bit is set to 1 when MEMRES14 is loaded with a new
conversion result.
Reading MEMRES14 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG15" description="Raw interrupt status for MEMRES15.
This bit is set to 1 when MEMRES15 is loaded with a new
conversion result.
Reading MEMRES15 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG16" description="Raw interrupt status for MEMRES16.
This bit is set to 1 when MEMRES16 is loaded with a new
conversion result.
Reading MEMRES16 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG17" description="Raw interrupt status for MEMRES17.
This bit is set to 1 when MEMRES17 is loaded with a new
conversion result.
Reading MEMRES17 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG18" description="Raw interrupt status for MEMRES18.
This bit is set to 1 when MEMRES18 is loaded with a new
conversion result.
Reading MEMRES18 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG19" description="Raw interrupt status for MEMRES19.
This bit is set to 1 when MEMRES19 is loaded with a new
conversion result.
Reading MEMRES19 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG20" description="Raw interrupt status for MEMRES20.
This bit is set to 1 when MEMRES20 is loaded with a new
conversion result.
Reading MEMRES20 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG22" description="Raw interrupt status for MEMRES22.
This bit is set to 1 when MEMRES22 is loaded with a new
conversion result.
Reading MEMRES22 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG23" description="Raw interrupt status for MEMRES23.
This bit is set to 1 when MEMRES23 is loaded with a new
conversion result.
Reading MEMRES23 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG8" description="Raw interrupt status for MEMRES8.
This bit is set to 1 when MEMRES8 is loaded with a new
conversion result.
Reading MEMRES8 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG21" description="Raw interrupt status for MEMRES21.
This bit is set to 1 when MEMRES21 is loaded with a new
conversion result.
Reading MEMRES21 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
        </register>
