dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/ADC1_4MSPS_1.0.xml
        </group>
    <group id="ADC1_DMA_TRIG" name="ADC1_DMA_TRIG" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="ADC1_DMA_TRIG_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="9" end="0" width="10" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No bit is set means there is no pending interrupt request"/>
                <bitenum id="MEMRESIFG0" value="0x9" description="MEMRES0 data loaded interrupt"/>
                <bitenum id="MEMRESIFG1" value="0xA" description="MEMRES1 data loaded interrupt"/>
                <bitenum id="MEMRESIFG2" value="0xB" description="MEMRES2 data loaded interrupt"/>
                <bitenum id="MEMRESIFG3" value="0xC" description="MEMRES3 data loaded interrupt"/>
                <bitenum id="MEMRESIFG4" value="0xD" description="MEMRES4 data loaded interrupt"/>
                <bitenum id="MEMRESIFG5" value="0xE" description="MEMRES5 data loaded interrupt"/>
                <bitenum id="MEMRESIFG6" value="0xF" description="MEMRES6 data loaded interrupt"/>
                <bitenum id="MEMRESIFG7" value="0x10" description="MEMRES7 data loaded interrupt"/>
                <bitenum id="MEMRESIFG8" value="0x11" description="MEMRES8 data loaded interrupt"/>
                <bitenum id="MEMRESIFG9" value="0x12" description="MEMRES9 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG10" value="0x13" description="MEMRES10 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG11" value="0x14" description="MEMRES11 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG12" value="0x15" description="MEMRES12 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG13" value="0x16" description="MEMRES13 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG14" value="0x17" description="MEMRES14 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG15" value="0x18" description="MEMRES15 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG16" value="0x19" description="MEMRES16 data loaded interrupt"/>
                <bitenum id="MEMRESIFG17" value="0x1A" description="MEMRES17 data loaded interrupt"/>
                <bitenum id="MEMRESIFG18" value="0x1B" description="MEMRES18 data loaded interrupt"/>
                <bitenum id="MEMRESIFG19" value="0x1C" description="MEMRES19 data loaded interrupt"/>
                <bitenum id="MEMRESIFG20" value="0x1D" description="MEMRES20 data loaded interrupt"/>
                <bitenum id="MEMRESIFG21" value="0x1E" description="MEMRES21 data loaded interrupt"/>
                <bitenum id="MEMRESIFG22" value="0x1F" description="MEMRES22 data loaded interrupt"/>
                <bitenum id="MEMRESIFG23" value="0x20" description="MEMRES23 data loaded interrupt"/>
            </bitfield>
        </register>
        <register id="ADC1_DMA_TRIG_IMASK" width="32" offset="0x8" description="Interrupt mask extension">
            <bitfield id="MEMRESIFG0" description="Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG1" description="Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG2" description="Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG3" description="Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG4" description="Raw interrupt status for MEMRES4.
This bit is set to 1 when MEMRES4 is loaded with a new
conversion result.
Reading MEMRES4 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG5" description="Raw interrupt status for MEMRES5.
This bit is set to 1 when MEMRES5 is loaded with a new
conversion result.
Reading MEMRES5 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG6" description="Raw interrupt status for MEMRES6.
This bit is set to 1 when MEMRES6 is loaded with a new
conversion result.
Reading MEMRES6 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG7" description="Raw interrupt status for MEMRES7.
This bit is set to 1 when MEMRES7 is loaded with a new
conversion result.
Reading MEMRES7 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG9" description="Raw interrupt status for MEMRES9.
This bit is set to 1 when MEMRES9 is loaded with a new
conversion result.
Reading MEMRES9 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG10" description="Raw interrupt status for MEMRES10.
This bit is set to 1 when MEMRES10 is loaded with a new
conversion result.
Reading MEMRES10 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG11" description="Raw interrupt status for MEMRES11.
This bit is set to 1 when MEMRES11 is loaded with a new
conversion result.
Reading MEMRES11 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG12" description="Raw interrupt status for MEMRES12.
This bit is set to 1 when MEMRES12 is loaded with a new
conversion result.
Reading MEMRES12 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG13" description="Raw interrupt status for MEMRES13.
This bit is set to 1 when MEMRES13 is loaded with a new
conversion result.
Reading MEMRES13 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG14" description="Raw interrupt status for MEMRES14.
This bit is set to 1 when MEMRES14 is loaded with a new
conversion result.
Reading MEMRES14 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG15" description="Raw interrupt status for MEMRES15.
This bit is set to 1 when MEMRES15 is loaded with a new
conversion result.
Reading MEMRES15 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG16" description="Raw interrupt status for MEMRES16.
This bit is set to 1 when MEMRES16 is loaded with a new
conversion result.
Reading MEMRES16 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG17" description="Raw interrupt status for MEMRES17.
This bit is set to 1 when MEMRES17 is loaded with a new
conversion result.
Reading MEMRES17 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG18" description="Raw interrupt status for MEMRES18.
This bit is set to 1 when MEMRES18 is loaded with a new
conversion result.
Reading MEMRES18 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG19" description="Raw interrupt status for MEMRES19.
This bit is set to 1 when MEMRES19 is loaded with a new
conversion result.
Reading MEMRES19 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG20" description="Raw interrupt status for MEMRES20.
This bit is set to 1 when MEMRES20 is loaded with a new
conversion result.
Reading MEMRES20 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG22" description="Raw interrupt status for MEMRES22.
This bit is set to 1 when MEMRES22 is loaded with a new
conversion result.
Reading MEMRES22 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG23" description="Raw interrupt status for MEMRES23.
This bit is set to 1 when MEMRES23 is loaded with a new
conversion result.
Reading MEMRES23 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG8" description="Raw interrupt status for MEMRES8.
This bit is set to 1 when MEMRES8 is loaded with a new
conversion result.
Reading MEMRES8 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG21" description="Raw interrupt status for MEMRES21.
This bit is set to 1 when MEMRES21 is loaded with a new
conversion result.
Reading MEMRES21 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
        </register>
